#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `success`          

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.remote["current"]: Reading...
data.terraform_remote_state.remote["connectivity"]: Reading...
module.landingzone.module.resource_groups["nonprod-rg"].azurecaf_name.rg: Refreshing state... [id=gpseankswihpxyxk]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurecaf_name.msi: Refreshing state... [id=vmajyoxprnfnjkms]
module.landingzone.module.container_registry["acr1"].azurecaf_name.acr: Refreshing state... [id=moddplacrsdsbckg]
data.terraform_remote_state.remote["connectivity"]: Read complete after 2s
data.terraform_remote_state.remote["current"]: Read complete after 2s
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-03-23 08:05:35.253084452 +0000 UTC]
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.module.resource_groups["nonprod-rg"].azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg]
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-03-23 08:05:36.638206777 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 0s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dvt_db_mi]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurecaf_name.subnet: Refreshing state... [id=ljipagxrddagydbj]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurecaf_name.subnet: Refreshing state... [id=gohlcjqjnmatgsni]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurecaf_name.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=vobcxxwdhlcdhpup]
module.landingzone.module.networking["spoke_re1"].azurecaf_name.caf_name_vnet: Refreshing state... [id=wqqnqpfircdwbrno]
module.landingzone.module.networking["spoke_re1"].azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurerm_network_security_group.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/aks_nodepool_system]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/private_endpoints]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.module.managed_identities["nonprodapp_mi"].time_sleep.propagate_to_azuread: Refreshing state... [id=2023-03-22T18:14:42Z]
module.landingzone.module.networking["spoke_re1"].azurerm_subnet_network_security_group_association.nsg_vnet_association["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.module.container_registry["acr1"].azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ContainerRegistry/registries/dvtnonprodacr]
module.landingzone.module.aks_clusters["aks_nonprod"].random_string.prefix: Refreshing state... [id=rynqomvpib]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.rg_node: Refreshing state... [id=aiwnnabbkpyiieyc]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.default_node_pool: Refreshing state... [id=cfdisopjgbuughnx]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.aks: Refreshing state... [id=ppynyodyrkfvqmqk]
module.landingzone.module.aks_clusters["aks_nonprod"].azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ContainerService/managedClusters/akscluster-re1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landingzone.module.resource_groups["nonprod-rg"].azurerm_resource_group.rg has changed
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg"
        name     = "app-nonprod-rg"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.landingzone.azurecaf_name.peering["spoke_to_hub"] will be created
  + resource "azurecaf_name" "peering" {
      + clean_input   = true
      + id            = (known after apply)
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_virtual_network_peering"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.azurerm_virtual_network_peering.peering["spoke_to_hub"] will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = (known after apply)
      + remote_virtual_network_id    = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/dvt-vnet-hub"
      + resource_group_name          = "app-nonprod-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "aks"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ objects         = (sensitive value)

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*